# drone_yolov11_6ch.yaml

ch: 6                  # RGB+IR toplam kanal
nc: 1                  # tek sınıf
depth_multiple: 0.33
width_multiple: 1.0    # 0.5 yerine 1.0 ile kanal uyumsuzluğunu kaldırıyoruz

anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

backbone:
  [
    [-1, 1, Focus, [64]],            # Focus(6→24), Conv(24→64)
    [-1, 1, Conv, [128, 3, 2]],      # Conv(64→128)
    [-1, 3, BottleneckCSP, [128]],
    [-1, 1, Conv, [256, 3, 2]],      # Conv(128→256)
    [-1, 6, BottleneckCSP, [256]],
    [-1, 1, Conv, [512, 3, 2]],      # Conv(256→512)
    [-1, 3, BottleneckCSP, [512]],
    [-1, 1, Conv, [1024, 3, 2]],     # Conv(512→1024)
    [-1, 1, SPP, [1024, [5, 9, 13]]],
    [-1, 3, BottleneckCSP, [1024, False]]
  ]

head:
  [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 6], 1, Concat, [1]],
    [-1, 3, BottleneckCSP, [512, False]],

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 4], 1, Concat, [1]],
    [-1, 3, BottleneckCSP, [256, False]],

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 13], 1, Concat, [1]],
    [-1, 3, BottleneckCSP, [512, False]],

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 9], 1, Concat, [1]],
    [-1, 3, BottleneckCSP, [1024, False]],

    [[17, 20, 23], 1, Detect, [nc, anchors]]
  ]
